taroko-batch-ecs/src/main/resources/TWMP/eaiEndpoint_request.xml

<soapenv:Envelope xmlns:ecs="http://ecs.tcb-bank.com.tw/ecs-ws-bus/ws/ecs" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken wsu:Id="UsernameToken-63297F6F6D79D6EC4816-****-****-0946">
				<wsse:Username>ecs</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">CsGBqjoAQpDncBdV6+oU9Q==</wsse:Nonce>
				<wsu:Created>2021-07-14T10:16:21.094Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ecs:eaiEndpoint>
			<Header>
				<ClientTraceID>tt090****26262369</ClientTraceID>
				<SrcSystemID>MBQ</SrcSystemID>
				<UserID>00000</UserID>
				<UserPwd>00000</UserPwd>
				<SessionID>00000</SessionID>
				<TxnID>eaicrshce06</TxnID>
				<ClientDt>2021-07-14T18:16:21.076</ClientDt>
			</Header>
			<SvcRq xsi:type="ecs:CRSHCE06SvcRq" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
				<InDate>20210714</InDate>
				<InTime>181621</InTime>
				<MsgType>0302</MsgType>
				<PrsCode>TGW21</PrsCode>
				<Stan>21071412345678</Stan>
				<FiscStan/>
				<FiscTxSeqNo/>
				<TPan/>
				<ReasonCode>00</ReasonCode>
			</SvcRq>
		</ecs:eaiEndpoint>
	</soapenv:Body>
</soapenv:Envelope>